This is still your LXD server rejecting the config. The provider only pass the options to the server.

```
> terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # lxd_network.example will be created
  + resource "lxd_network" "example" {
      + config  = {
          + "dns.search" = "example.org"
        }
      + id      = (known after apply)
      + managed = (known after apply)
      + name    = "example"
      + type    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

lxd_network.example: Creating...
lxd_network.example: Creation complete after 1s [id=example]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
```
> lxc network show example
config:
  dns.search: example.org
  ipv4.address: 10.146.5.1/24
  ipv4.nat: "true"
  ipv6.address: fd42:b3a7:2eac:76c6::1/64
  ipv6.nat: "true"
description: ""
name: example
type: bridge
used_by: []
managed: true
status: Created
locations:
- none
```

```
> lxc version
Client version: 4.10
Server version: 4.10
```

Can you create the network with your option *without* the plugin, e.g. using the `lxc` command line client?
